Repository: wp-plugins/hreflang-flag
Catalog: hreflang-flag-*.po
Languages: fr_fr

source: hreflang Flag Options
fr_fr: Configuration de hreflang Flag

source: The included flags mostly comes from <a href="http://www.famfamfam.com">http://www.famfamfam.com</a>, some more from <a href="http://blog.johncrepezzi.com/archives/104">John Crepezzi's blog</a> and I added one... For details check the <a href="%sflags/LICENSE">icon's license file</a>. But the configuration allows you to use any other set of icons you want, simply update the URL and path bellow (the path is for hreflang Flag to do some checks on the images, it's only used for the configuration). And then complete your flag configuration.
fr_fr: Les drapeaux inclus proviennent pour la plupart de <a href="http://www.famfamfam.com">http://www.famfamfam.com</a>, d'autre viennent du <a href="http://blog.johncrepezzi.com/archives/104">blog de John Crepezzi</a> et j'en ai ajouté un...Pour plus de détails, consulter le <a href="%sflags/LICENSE">fichier de licence des icones</a>. Mais la configuration vous permet d'utiliser n'importe quel autre jeu d'icones, pour ce faire, mettez simplement à jour l'URL et le répertoire ci-dessous (le répertoire n'est utilisé par hreflang Flag que pour effectuer quelques vérifications sur les images, et ce seulement dans l'interface de configuration). Ensuite completez votre configuration des drapeaux.

source: Left
fr_fr: Gauche

source: Right
fr_fr: Droite

source: Automatic style
fr_fr: Style gérée automatiquement

source: Custom Style
fr_fr: Style personalisé

source: hreflang Flag uses CSS to add flags to links, see <a href="http://www.w3.org/TR/css3-selectors/#attribute-selectors">W3C CSS3 Attribute selectors description</a> for more details on how it's defined.
fr_fr: hreflang Flag utilise le CSS pour ajouter un drapeau aux liens. Consultez la description des <a href="http://www.w3.org/TR/css3-selectors/#attribute-selectors"> sélecteurs d'attribut CSS3 du W3C</a> pour plus de détails sur leur definition.

source: select match kind
fr_fr: sélectionnez un comparateur

source: match string
fr_fr: chaine à comparer

source: image file
fr_fr: fichier d'image

source: Fill this to add a new flag and save changes.
fr_fr: Remplissez cette ligne pour ajouter un nouveau drapeau puis enregistrez les modifications.

source: You can also remove a flag by clearing either the match string or the image file.
fr_fr: Vous pouvez aussi supprimer un drapeau en effaçant la chaine à comparer ou le nom de fichier d'image.

source: The order flags apear in the above table will be the order used in the css, so the last match is applied.
fr_fr: L'ordre d'apparition des drapeaux dans le tableau ci-dessus sera l'ordre utilisé pour créer le CSS, ainsi la dernière règle validée sera appliquée.

source: Main Settings
fr_fr: Configuration générale

source: Flags base URL
fr_fr: URL de base des drapeaux

source: Flags base directory
fr_fr: Répertoire de base des drapeaux

source: This directory must correspond to the URL above.
fr_fr: Ce répertoire doit correspondre à l'URL ci-dessus.

source: Flag icon position
fr_fr: Position du drapeau

source: Test flag
fr_fr: Drapeau de test

source: Some text a
fr_fr: Quelques mots, un

source: sample Link
fr_fr: lien d'exemple

source: some more text.
fr_fr: encore des mots.

source: CSS Selector
fr_fr: Sélecteur CSS

source: Comma separated list of CSS selector (each will be used before the "a" tag in the CSS definition).<br />Example: ".entry" will show flags only inside post/page entry nowhere else.
fr_fr: Liste séparée par des virgules de sélecteur CSS (chaque élément sera placé avant le tag "a" dans la définition CSS).<br />Exemple: ".entry" limitera l'apparition des drapeaux dans les articles et les pages et pas en dehors.

source: Flag Settings
fr_fr: Configuration des drapeaux

source: Add a flag icon to link corresponding to the hreflang attribute.
fr_fr: Ajoute une icone de drapeau à chaque lien en fonction de l'attribut hreflang.
